gdgly/NUC97X_JS/STM32F4xx/DL698/RM_RxDATA_DL1997.cpp

#include "Project698.h"
#include "../DL698/DL698_DataDef.h"
#include "../DL698/RM_RxDATA.h"

#include "../Device/MEMRW.h"
#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../Calculate/Calculate.h"



u32 RM_RxDATA_DL1997_CHECK(u32 PORTn)//DL645_1997帧接收数据,比较发收地址、控制码、数据标识、减0x33;返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
{
	u32 i;
	u32 x;
	u8 * p8rx;
	UARTCtrl_TypeDef * UARTCtrl;
	u8* p8;
	
	p8=p8;
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
/*
#if ((Project/100)==2)//集中器
#if SEL_RouterRunMode3ADDR==1//微功率无线发送帧目标地址:0=电能表地址，1=采集器地址
	if((PORTn==RS485_4PORT)&&(Terminal_Router->RouterRunMode_1==3))//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
	{//微功率无线,目标地址用采集器地址
		i=UARTCtrl->TaskID;
		i>>=8;
		i&=0xff;
		switch(i)
		{
			case RMTASKnoPOWER://停上电事件固定任务号
				i=UARTCtrl->MeterCount[i];
				i=PowerEvent->setno[i];
				break;
			default:
				i=UARTCtrl->MeterCount[i];
				break;
		}
		p8=(u8*)ADDR_6000_SDRAM+(i*LENper_6000);
		p8=Get_Element(p8,3,0,0);//计算元素地址
		if(p8)
		{//采集器可取
			p8+=5;
			x=p8[4]|(p8[5]<<8);
			i=(p8rx[1]<<8)|p8rx[2];
			if(i!=x)
			{
				return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
			}
			x=p8[2]|(p8[3]<<8);
			i=(p8rx[3]<<8)|p8rx[4];
			if(i!=x)
			{
				return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
			}
			x=p8[0]|(p8[1]<<8);
			i=(p8rx[5]<<8)|p8rx[6];
			if(i!=x)
			{
				return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
			}
		}
		else
		{
			return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
		}
	}
	else
#endif
#endif
*/
	{
		i=(p8rx[1]<<8)|p8rx[2];
		if(i!=UARTCtrl->RMAddr[2])
		{
			return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
		}
		i=(p8rx[3]<<8)|p8rx[4];
		if(i!=UARTCtrl->RMAddr[1])
		{
			return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
		}
		i=(p8rx[5]<<8)|p8rx[6];
		if(i!=UARTCtrl->RMAddr[0])
		{
			return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
		}
	}
	//控制码
	if((p8rx[8]&0x40)!=0x0)
	{//从站异常回答
		return 2;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
	}
	//减0x33
	for(i=0;i<p8rx[9];i++)
	{
		p8rx[10+i]-=0x33;
	}
	//DI比较
	x=p8rx[10];
	x|=p8rx[10+1]<<8;
	if(x!=UARTCtrl->RM_DI)
	{
		return 3;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
	}
	return 0;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
}

__align(4) const u32 signed_DL1997_List[]=//DL/T-1997数据带有正负符号的数据标识列表
{
//变量
	0xB62F,//电流
	0xB63F,//瞬时有功功率
	0xB64F,//瞬时无功功率
	0xB65F,//功率因数
};

u32 signed_DL1997_DI(u32 PORTn)//DL/T-1997数据带有正负符号的数据标识;入口:UARTCtrl->RM_DI;返回:0=没符号，1=有符号
{
	u32 i;
	u32 x;
	u32 RMDI1;
	u32 RMDI0;
	UARTCtrl_TypeDef * UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	i=UARTCtrl->RM_DI;
	RMDI0=i&0xff;
	RMDI1=(i>>8);
	for(i=0;i<(sizeof(signed_DL1997_List)/4);i++)
	{
		x=signed_DL1997_List[i];
		x>>=8;
		if(RMDI1==x)
		{
				x=signed_DL1997_List[i];
				x&=0xff;
				if(x==RMDI0)
				{
					return 1;
				}
		}
	}
	return 0;
}

//UART抄表数据缓冲定义
//#define LEN_RM_DI_CSD     512
//抄表数据缓冲1,最大总长度=LEN_RM_DI_CSD
//0 6byte 电能表地址
//6 2byte 长度=时标+已采集的CSD(不包括本身2字节)

//8 7byte 采集启动时标  date_time_s(无数据类型)
//15 7byte 采集成功时标  date_time_s(无数据类型)
//22 7byte 采集存储时标  date_time_s(无数据类型)
//29  采集的CSD  array CSD(有数据类型)

//抄表数据缓冲2,最大总长度=LEN_UARTnFnDataBuff-LEN_RM_DI_CSD
//LEN_RM_DI_CSD   2byte 长度=已填写入buff但还没完整一个CSD的数据长度(不包括本身2字节)
//LEN_RM_DI_CSD+2 2byte 长度=已填写入buff完整CSD的数据长度(不包括本身2字节)
//LEN_RM_DI_CSD+4 采集的数据(有数据类型)

u32 RxDATA_Process_DL1997(u32 PORTn,u32 Byte_DATAper,u32 DPbit,u32 DataType)
{	
	u32 i;
	u32 j;
	u32 n;
	u32 Data;
	u32 LEN_Rx;
	u32 LEN_RxDataBuff;
	u32 LEN_Data0;
	u32 LEN_Data1;
	u32 Byte;
	u8* p8CSD;
	u8* p8Array;
	u8* p8Data;
	u8* p8rx;
	u16* p16Data;
	UARTCtrl_TypeDef * UARTCtrl;
	
	p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
	LEN_Rx=p8rx[9];
	if(LEN_Rx<=2)
	{//长度<2
		return 0;
	}
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	LEN_RxDataBuff=Get_LEN_UARTnFnDataBuff(PORTn);//得到UART抄表数据缓冲长度
	LEN_RxDataBuff-=(LEN_RM_DI_CSD+4);
	p8CSD=(u8 *)Get_ADDR_UARTnFnDataBuff(PORTn);
	p16Data=(u16*)(p8CSD+LEN_RM_DI_CSD);
	LEN_Data1=p16Data[1];
	if(LEN_RxDataBuff<LEN_Data1)
	{//错
		return 3;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
	}
	LEN_RxDataBuff-=LEN_Data1;
	p8Data=(u8*)(p8CSD+LEN_RM_DI_CSD+4+LEN_Data1);
	p8Array=(u8*)p8Data;
	if(UARTCtrl->RMCSDSubCount==0)//抄表CSD子计数(非DL698抄表时)
	{
		p16Data[0]=0;//已填写入buff但还没完整一个CSD的数据长度(不包括本身2字节)
	}
	LEN_Data0=p16Data[0];
	if(LEN_RxDataBuff<LEN_Data0)
	{//错
		return 1;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
	}
	LEN_RxDataBuff-=LEN_Data0;
	
	if(LEN_Data0==0)//抄表CSD子计数(非DL698抄表时)
	{
		if(UARTCtrl->RMCSDSubCount!=0)
		{
			UARTCtrl->RMCSDSubCount=UARTCtrl->RMCSDSubCountMax;
			p16Data[0]=0;
			return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
		}
		if(LEN_RxDataBuff<2)
		{//缓冲长度不够
			return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
		}
		p8Data+=LEN_Data0;
		p8Array=(u8*)p8Data;
		p8Array[0]=DataType_array;
		p8Array[1]=0;
		LEN_Data0+=2;
		LEN_RxDataBuff-=2;
		p8Data+=LEN_Data0;
	}
	else
	{
		if(p8Array[1]!=UARTCtrl->RMCSDSubCount)
		{
			UARTCtrl->RMCSDSubCount=UARTCtrl->RMCSDSubCountMax;
			p16Data[0]=0;
			return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
		}
		p8Data+=LEN_Data0;
	}
	
	p8rx+=12;
	LEN_Rx-=2;
	n=LEN_Rx/Byte_DATAper;//数组个数=数据长度除以每个数据的字节数
	for(i=0;i<n;i++)
	{
		Data=0;
		for(Byte=0;Byte<Byte_DATAper;Byte++)
		{
			Data|=p8rx[0]<<(Byte*8);
			p8rx++;
		}
		switch(Byte_DATAper)
		{
			case 2:
				if(Data==0xffff)
				{
					Data=0;
				}
				break;
			case 3:
				if(Data==0xffffff)
				{
					Data=0;
				}
				break;
			default:
				break;
		}		
		switch(DataType)
		{
			case DataType_long_unsigned:
				Data<<=DPbit;//645小数位跟698不一致							
				Data=bcd_hex(Data);
				if(LEN_RxDataBuff<3)
				{//缓冲长度不够
					return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
				}
				p8Data[0]=DataType_long_unsigned;
				p8Data[1]=Data>>8;
				p8Data[2]=Data;
				p8Data+=3;
				LEN_Data0+=3;
				LEN_RxDataBuff-=3;
				break;
			case DataType_long:
				Data<<=DPbit;//645小数位跟698不一致							
				j=Data&(1<<((Byte_DATAper*8)-1));
				if(j)
				{//负
					Data&=~(1<<((Byte_DATAper*8)-1));//去符号位
					Data=bcd_hex(Data);
					Data=~Data;
					Data++;
				}
				else
				{
					Data=bcd_hex(Data);
				}
				if(LEN_RxDataBuff<3)
				{//缓冲长度不够
					return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
				}
				p8Data[0]=DataType_long;
				p8Data[1]=Data>>8;
				p8Data[2]=Data;
				p8Data+=3;
				LEN_Data0+=3;
				LEN_RxDataBuff-=3;
				break;
			case DataType_double_long:
				Data<<=DPbit;//645小数位跟698不一致							
				j=Data&(1<<((Byte_DATAper*8)-1));
				if(j)
				{//负
					Data&=~(1<<((Byte_DATAper*8)-1));//去符号位
					Data=bcd_hex(Data);
					Data=~Data;
					Data++;
				}
				else
				{
					Data=bcd_hex(Data);
				}
				if(LEN_RxDataBuff<5)
				{//缓冲长度不够
					return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
				}
				p8Data[0]=DataType_double_long;
				p8Data[1]=Data>>24;
				p8Data[2]=Data>>16;
				p8Data[3]=Data>>8;
				p8Data[4]=Data;
				p8Data+=5;
				LEN_Data0+=5;
				LEN_RxDataBuff-=5;
				break;
			case DataType_double_long_unsigned:
				Data<<=DPbit;//645小数位跟698不一致							
				Data=bcd_hex(Data);
				if(LEN_RxDataBuff<5)
				{//缓冲长度不够
					return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
				}
				p8Data[0]=DataType_double_long;
				p8Data[1]=Data>>24;
				p8Data[2]=Data>>16;
				p8Data[3]=Data>>8;
				p8Data[4]=Data;
				p8Data+=5;
				LEN_Data0+=5;
				LEN_RxDataBuff-=5;
				break;
			default:
				break;
		}
		if(p8Array[1]>=127)
		{
			return 5;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
		}
		p8Array[1]++;//增加数组数
	}
	p16Data[0]=LEN_Data0;
	return 0;
}

u32 RM_RxDATA_DL1997(u32 PORTn)//抄表接收数据处理:返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
{
	u32 i;
	u32 OI;
	u32 Data;
	u32 LEN_Rx;
	u32 LEN_RxDataBuff;
	u32 LEN_Data0;
	u32 LEN_Data1;
	u32 signedDI;
	u8* p8CSD;
	u8* p8Array;
	u8* p8Data;
	u16* p16Data;
	u8* p8rx;
	UARTCtrl_TypeDef * UARTCtrl;
	u32 n;
	
	p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
	LEN_Rx=p8rx[9];
	if(LEN_Rx<=2)
	{//长度<2
		return 0;
	}
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	LEN_RxDataBuff=Get_LEN_UARTnFnDataBuff(PORTn);//得到UART抄表数据缓冲长度
	LEN_RxDataBuff-=(LEN_RM_DI_CSD+4);
	p8CSD=(u8 *)Get_ADDR_UARTnFnDataBuff(PORTn);
	p16Data=(u16*)(p8CSD+LEN_RM_DI_CSD);
	LEN_Data1=p16Data[1];
	if(LEN_RxDataBuff<LEN_Data1)
	{//错
		return 3;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
	}
	LEN_RxDataBuff-=LEN_Data1;
	p8Data=(u8*)(p8CSD+LEN_RM_DI_CSD+4+LEN_Data1);
	p8Array=(u8*)p8Data;
	if(UARTCtrl->RMCSDSubCount==0)//抄表CSD子计数(非DL698抄表时)
	{
		p16Data[0]=0;//已填写入buff但还没完整一个CSD的数据长度(不包括本身2字节)
	}
	LEN_Data0=p16Data[0];
	if(LEN_RxDataBuff<LEN_Data0)
	{//错
		return 1;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
	}
	LEN_RxDataBuff-=LEN_Data0;
	
